import math

variant = 6
a = 0.2 * (variant - 5)
b = a
A = [
            [8.30, 2.62+a, 4.10, 1.90],
            [3.92, 8.45, 8.78-a, 2.46],
            [3.77, 7.21+a, 8.04, 2.28],
            [2.21, 3.65-a, 1.69, 6.99]
    ]
B = [-10.65+b, 12.21, 15.45-b, -8.35]

# r = B - Ax
x = [-4.304, -8.392, 11.196, 1.6019]        #результати обчислення програми
r = [0, 0, 0, 0]

for i in range(len(A)):
    for j in range(len(x)):
        r[i] += A[i][j]*x[j]            #знаходження Ах
    r[i] = B[i]-r[i]                    #знаходження b-Ax
print("Вектор нев'язки для отриманого розв'язку")
for i in range(len(x)):
    r[i] = round(r[i], 6)       #округлення д 6-и знаків після коми
print(r)
print()

# r = B - Axm
xm = [-4.30489826998, -8.39292339458, 11.1963427229, 1.60194444725]     #результати обчислення калькулятора
r = [0, 0, 0, 0]

for i in range(len(A)):
    for j in range(len(x)):
        r[i] += A[i][j]*xm[j]           #знаходження Ахm
    r[i] = B[i]-r[i]                     #знаходження b-Axm
print("Вектор нев'язки для отриманого розв'язку в онлайн калькуляторі")
for i in range(len(x)):
    r[i] = round(r[i], 6)       #округлення д 6-и знаків після коми
print(r)
print()

# d = sqrt( 1/n * sum[k=1 -> n](xk - xmk)^2 )
d = 0
for i in range(len(x)):
    d += math.pow((x[i] - xm[i]), 2)            #сума ряду
d /= len(x)                                     #поділити на кількість елементів
d = math.sqrt(d)                                #квадратний корінь
print("Середньоквадратична похибка")
print(d)
